Documents/ПередачаНаКомиссию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПередачаНаКомиссию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаКомиссии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупкиСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКомитента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПередачаНаКомиссию/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;  
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

 	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
    ЗаполнитьКэшДанных();
	
	СтруктураПечатныхФорм = Документы.ПередачаНаКомиссию.ПолучитьСтруктуруПечатныхФорм();  
	ПараметрыРазмещения = Новый Структура("Форма, ЭтоФормаОбъекта, КоманднаяПанель", ЭтаФорма, Ложь, Неопределено);
	ОбщегоНазначенияСервер.ПодключитьКомандыПечати(ПараметрыРазмещения, СтруктураПечатныхФорм);   

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	РаботаСоСканеромШК.СканерШКПодключить();  
	ОтобразитьЦветВалюты();
	
	ОтобразитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
 КонецПроцедуры 
 
#КонецОбласти 


#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)

	ОтобразитьЦветВалюты();

КонецПроцедуры
 
 &НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли;
	ОтобразитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	
	ЛюбаяСерия(РучнойШК, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИтоги()

	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект); 
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));

КонецПроцедуры

#КонецОбласти 


#Область РаботаСоШтрихкодом

&НаКлиенте
Процедура ЛюбаяСерия(ШК, СтатьНаРучной = Ложь) 
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	//Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	//МоиИтоги(Объект.Товары.Количество()-1);
	
	Ошибки = Новый СписокЗначений;  
	Если НЕ ЗначениеЗаполнено(Объект.СкладКомиссии) Тогда
		Ошибки.Добавить("Не выбран склад комиссии");
	КонецЕсли; 
	Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Ошибки.Добавить("Не выбран контрагент");
	КонецЕсли; 
	Если Ошибки.Количество() > 0  Тогда
		Для каждого ош Из Ошибки Цикл
		    Сообщить(ош.Значение);
		КонецЦикла;
		Возврат;
	КонецЕсли;
	
	СписокПартий = омСервер.ПартииПоСерииОстатки(ШК, Объект.Фирма, Объект.Склад);
	
	КолвоПартий = СписокПартий.Количество();
	Если КолвоПартий = 0 Тогда
		Сигнал();
		клОшибка("Нет остатков по серии: " + ШК + "!");
		Возврат;
	ИначеЕсли КолвоПартий > 1 Тогда
		Сигнал();
		Эле = СписокПартий.ВыбратьЭлемент("Найдено несколько партий с такой серией, выберите:");
		Если Эле = Неопределено Тогда Возврат КонецЕсли;
		ТекПартия = Эле.Значение;
	Иначе
		ТекПартия = СписокПартий[0].Значение;
	КонецЕсли; 
	
	НовНоменклатура = гоРеквизит(ТекПартия, "Владелец");
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНоменклатура;
	НовСтр.Партия 		= ТекПартия;  
	НовСтр.Серия 		= гоРеквизит(ТекПартия, "Серия");
	НовСтр.ЦенаЗакупки 	= гоРеквизит(ТекПартия, "ЦенаЗакупки");
	НовСтр.Количество 	= 1;
	
	//гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = НовСтр.ПолучитьИдентификатор();
	
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("ОжиданиеШК", 0.1, Истина);
	КонецЕсли;  

	Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеШК()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	////Если ЭтаФорма.ТолькоПросмотр ИЛИ Объект.Окончательно Тогда
	////	Возврат;
	////КонецЕсли;
	////
	////МоиИтоги();
	////Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	//
	////Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Store not specified!'")); Возврат; КонецЕсли; 
	////Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	////
	////Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	//
	//Буф = РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера();
	//
	////если уже есть такой товар, зачем искать цену
	//Если Объект.Товары.Количество() > 0 Тогда
	//	ЕстЦен = 0;
	//	Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНоменклатура));
	//	Если Мас.Количество() > 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	//КонецЕсли; 
	//
	//////2016.04.23
	////Если ЕстЦен <> 0 Тогда 
	////	НовЦен = ЕстЦен;
	////Иначе 
	////	НовЦен = 0;
	////	Если НЕ ВвестиЧисло(НовЦен, "Цена (0 - взять цены прихода)", 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	////КонецЕсли;
	//
	//НСтр = СтрЧислоСтрок(Буф);
	//
	////тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	//Для Н = 1 По НСтр Цикл
	//	СС = "";
	//	С = СтрПолучитьСтроку(Буф, Н);
	//	Пока (СС = "") И (С <> "") Цикл
	//		СС = гоСледПолеТаб(С);
	//	КонецЦикла; 
	//	ЛюбаяСерия(СС);
	//КонецЦикла;  
	
	РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера(Новый ОписаниеОповещения("ИзБуфераОбменаПослеПолученияБуфера", ЭтотОбъект));

КонецПроцедуры

 &НаКлиенте
Процедура ИзБуфераОбменаПослеПолученияБуфера(Буф, ДопПараметры) Экспорт
	
	//если уже есть такой товар, зачем искать цену
	Если Объект.Товары.Количество() > 0 Тогда
		ЕстЦен = 0;
		Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНоменклатура));
		Если Мас.Количество() > 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 
	
	////2016.04.23
	//Если ЕстЦен <> 0 Тогда 
	//	НовЦен = ЕстЦен;
	//Иначе 
	//	НовЦен = 0;
	//	Если НЕ ВвестиЧисло(НовЦен, "Цена (0 - взять цены прихода)", 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	//КонецЕсли;
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		ЛюбаяСерия(СС);
	КонецЦикла;  
	
КонецПроцедуры

#КонецОбласти              

#Область КомандыФормы

&НаКлиенте
Процедура УдалитьВсе(Команда)
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	
	клНетДа(Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект), НСтр("ru = 'Удалить все строки?'; en = 'Delete all lines?'"));

КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(Результат, ДопПараметры) Экспорт
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Объект.Товары.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенные(Команда)

	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли;
	ВыдСтр = Элементы.Товары.ВыделенныеСтроки;
	ВыдКол = ВыдСтр.Количество();
	Если ВыдКол <= 1 Тогда Возврат КонецЕсли;
	клНетДа(Новый ОписаниеОповещения("УдалитьВыделенныеЗавершение", ЭтотОбъект, ВыдСтр),
		стрШаблон(НСтр("ru = 'Удалить выделенные (%1) строки?'; en = 'Delete selected (%1) lines?'"), ВыдКол));
		
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыделенныеЗавершение(Результат, ВыдСтр) Экспорт
	
	Если НЕ Результат Тогда Возврат КонецЕсли;
	
	Удалить = Новый Массив;
	
	Для Каждого ИДИ Из ВыдСтр Цикл
		Стр = Объект.Товары.НайтиПоИдентификатору(ИДИ);
		Если Стр = Неопределено Тогда клОшибка("Странно, не нашли текущую строку по ИДИ=" + ИДИ + "!"); Продолжить; КонецЕсли;
		Удалить.Добавить(Стр);
	КонецЦикла;
	
	Для Каждого Стр Из Удалить Цикл
		Объект.Товары.Удалить(Стр);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ДействияТабличнойЧасти

&НаКлиенте
Процедура ТоварыНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// 1. Отключаем стандартный механизм открытия формы
	СтандартнаяОбработка = Ложь;
	
	//// 2. Создаем структуру с полями, по которым нужен отбор
	//Отбор = Новый Структура;
	//Отбор.Вставить("ТипНоменклатуры", ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга"));
	//
	//// Если нужно значение из текущей строки табличной части:
	//// ТекДанные = Элементы.Товары.ТекущиеДанные;
	//// Отбор.Вставить("Поставщик", ТекДанные.Контрагент);
	//
	//// 3. Создаем параметры для открываемой формы
	//ПараметрыОткрытия = Новый Структура;
	//ПараметрыОткрытия.Вставить("Отбор", Отбор);
	//
	//// 4. Открываем форму выбора
	//// ВАЖНО: Третьим параметром передаем сам "Элемент". 
	//// Благодаря этому платформа сама поймет, куда вставить выбранное значение, 
	//// и вам не придется писать код в событии "ОбработкаВыбора".
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, Элемент);
	
	ПараметрыОткрытия = Новый Структура("Склад", Объект.Склад);
	ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОтобразитьИтоги();

КонецПроцедуры

&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ОтобразитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	// 1. Отключаем предыдущий вызов, чтобы они не накапливались при быстром скроллинге
    ОтключитьОбработчикОжидания("ОбновитьИнфоСтрокуАсинхронно");
    
    // 2. Подключаем обработчик однократно с задержкой 0.2 секунды
    ПодключитьОбработчикОжидания("ОбновитьИнфоСтрокуАсинхронно", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнфоСтрокуАсинхронно()
    
    ТекДанные = Элементы.Товары.ТекущиеДанные;
    
    Если ТекДанные = Неопределено Тогда 
        Элементы.ДекорацияИнфоСтроки.Заголовок = "";
        Возврат;
    КонецЕсли;
    
    Ит = 0;
    НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекДанные.Номенклатура));
    Для каждого НайдСтрока Из НайдСтроки Цикл
        Ит = Ит + НайдСтрока.Количество;
    КонецЦикла;
    
    Если Ит > 0 Тогда
        Стр = СтрШаблон("%1: %2", 
                        НСтр("ru = 'Количество товара текущей строки'; en = 'Quantity of the current line good'"),
                        омСервер.Фрмт(Ит, "ЧИСЛОЦЕЛ_ЦВ1"));
                        
        Элементы.ДекорацияИнфоСтроки.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(Стр));                
    Иначе
        Элементы.ДекорацияИнфоСтроки.Заголовок = "";
    КонецЕсли;    
    
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыПартияПриИзменении(Элемент)
	
	ТекДанные = Элементы.Товары.ТекущиеДанные;
	ТекДанные.Серия 				= гоРеквизит(ТекДанные.Партия, "Серия");
	ТекДанные.ЦенаЗакупки			= гоРеквизит(ТекДанные.Партия, "ЦенаЗакупкиВБазВалюте");
	ТекДанные.ЦенаЗакупкиСЗатратами	= ТекДанные.ЦенаЗакупки + ЗатратыПартии(ТекДанные.Партия); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаКомитентаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
    ТекДанные.Сумма = ТекДанные.ЦенаКомитента * ТекДанные.Количество;
	
	Если ТекДанные.ЦенаКомитента > 0 Тогда
		НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекДанные.Номенклатура));
		Если НайдСтроки.Количество() > 0 Тогда
			ОписаниеОповещения = Новый ОписаниеОповещения("ПослеПодтвержденияЦены", ЭтаФорма, 
															Новый Структура("Цена,СтрокиТЧ", ТекДанные.ЦенаКомитента, НайдСтроки));
			ПоказатьВопрос(ОписаниеОповещения, "Установить эту цену для всех таких же товаров?", РежимДиалогаВопрос.ДаНет);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияЦены(Результат, Параметры) Экспорт  
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Для каждого СтрокаТЧ Из Параметры.СтрокиТЧ Цикл
			СтрокаТЧ.ЦенаКомитента = Параметры.Цена;
			СтрокаТЧ.Сумма = СтрокаТЧ.ЦенаКомитента * СтрокаТЧ.Количество;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекДанные.Количество = 0 Тогда
	 	ТекДанные.Количество = 1;
	КонецЕсли;	
	ТекДанные.ЦенаКомитента = ТекДанные.Сумма / ТекДанные.Количество;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекДанные = Элементы.Товары.ТекущиеДанные;
    ТекДанные.Сумма = ТекДанные.ЦенаКомитента * ТекДанные.Количество;
	
КонецПроцедуры

&НаСервере
Функция ЗатратыПартии(Партия)
	
	СтруктураЗатрат = ПроведениеДокументов.ЗатратыПартий(Партия);
	ЗатратыПартии = СтруктураЗатрат.ЗатратыПартии + СтруктураЗатрат.ЗатратыПартииИнвойсов;
	Возврат ЗатратыПартии;	
	
КонецФункции // ЗатратыПартии()

#КонецОбласти  


#Область ПодключаемаяПечать
	
&НаКлиенте
Процедура ВыполнитьПодключеннуюПечать(Команда)
	
	ВариантПечатнойФормы = СтрЗаменить(Команда.Имя, "ПодключеннаяПечать_", "");   
	ТабДок = ПечатнаяФорма(ВариантПечатнойФормы);
	ПараметрыПечати = Новый Структура("Таб, Имя, НеДляПечати", ТабДок, гоИмя(Объект.Ссылка, Ложь), Ложь);
	ОткрытьФорму("ОбщаяФорма.ПечатьБезЗащиты", ПараметрыПечати, , Истина); 
		
КонецПроцедуры  

&НаСервере
Функция ПечатнаяФорма(ВариантПечатнойФормы)

	ТабДок = Новый ТабличныйДокумент;
	Документы.ПередачаНаКомиссию.ПечатьДокумента(Объект.Ссылка, ВариантПечатнойФормы, ТабДок);
	Возврат ТабДок;
	
КонецФункции 

#КонецОбласти
